Nikhil Dubey

In [4]:
import numpy as np
import pandas as pd

print(np.__version__)
print(pd.__version__)

2.4.2
3.0.0

In [5]:

print(np.__version__)
print(pd.__version__)

2.4.2
3.0.0

In [6]:
df= pd.read_csv("Employee.csv")
df.shape

(148, 6)

In [20]:
df

     level_0  index          Company   Age  Salary     Place Country  Gender
0          0      0              TCS  20.0     NaN   Chennai   India       0
1          1      1          Infosys  30.0     NaN    Mumbai   India       0
2          2      2              TCS  35.0  2300.0  Calcutta   India       0
3          3      3          Infosys  40.0  3000.0     Delhi   India       0
4          4      4              TCS  23.0  4000.0    Mumbai   India       0
..       ...    ...              ...   ...     ...       ...     ...     ...
139      139    142  Infosys Pvt Lmt  22.0  8202.0    Mumbai   India       0
140      140    143              TCS  33.0  9024.0  Calcutta   India       1
141      141    145          Infosys  44.0  4034.0     Delhi   India       1
142      142    146              TCS  33.0  5034.0    Mumbai   India       1
143      143    147          Infosys  22.0  8202.0    Cochin   India       0

[144 rows x 8 columns]

In [19]:
df.duplicated().sum()

np.int64(0)

In [12]:
df.drop_duplicates(inplace=True)
df.shape

(144, 6)

In [21]:
df = df.drop(columns=["level_0", "index"])
df

             Company   Age  Salary     Place Country  Gender
0                TCS  20.0     NaN   Chennai   India       0
1            Infosys  30.0     NaN    Mumbai   India       0
2                TCS  35.0  2300.0  Calcutta   India       0
3            Infosys  40.0  3000.0     Delhi   India       0
4                TCS  23.0  4000.0    Mumbai   India       0
..               ...   ...     ...       ...     ...     ...
139  Infosys Pvt Lmt  22.0  8202.0    Mumbai   India       0
140              TCS  33.0  9024.0  Calcutta   India       1
141          Infosys  44.0  4034.0     Delhi   India       1
142              TCS  33.0  5034.0    Mumbai   India       1
143          Infosys  22.0  8202.0    Cochin   India       0

[144 rows x 6 columns]

In [22]:
df.head(5)

   Company   Age  Salary     Place Country  Gender
0      TCS  20.0     NaN   Chennai   India       0
1  Infosys  30.0     NaN    Mumbai   India       0
2      TCS  35.0  2300.0  Calcutta   India       0
3  Infosys  40.0  3000.0     Delhi   India       0
4      TCS  23.0  4000.0    Mumbai   India       0

In [23]:
df.info()

<class 'pandas.DataFrame'>
RangeIndex: 144 entries, 0 to 143
Data columns (total 6 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Company  136 non-null    str
 1   Age      127 non-null    float64
 2   Salary   121 non-null    float64
 3   Place    130 non-null    str
 4   Country  144 non-null    str
 5   Gender   144 non-null    int64
dtypes: float64(2), int64(1), str(3)
memory usage: 6.9 KB

In [25]:
df.isna().sum()

Company     8
Age        17
Salary     23
Place      14
Country     0
Gender      0
dtype: int64

In [26]:
df.columns

Index(['Company', 'Age', 'Salary', 'Place', 'Country', 'Gender'], dtype='str')

In [30]:
unique= df.nunique()
unique

Company     6
Age        29
Salary     40
Place      11
Country     1
Gender      2
dtype: int64

In [32]:
df['Company'].unique()

<StringArray>
[                      'TCS',                   'Infosys',
                       'CTS',                         nan,
 'Tata Consultancy Services',                'Congnizant',
           'Infosys Pvt Lmt']
Length: 7, dtype: str

In [33]:
df['Age'].unique()

array([20., 30., 35., 40., 23., nan, 34., 45., 18., 22., 32., 37., 50.,
       21., 46., 36., 26., 41., 24., 25., 43., 19., 38., 51., 31., 44.,
       33., 17.,  0., 54.])

In [36]:
df['Company'] = df['Company'].replace('Infosys Pvt Ltd', 'Infosys')
df['Company'] = df['Company'].replace('Tata Consultancy Services', 'TCS')
df['Company'] = df['Company'].replace('CTS', 'Cognizant')
df['Company'] = df['Company'].replace('Congnizant', 'Cognizant')

df['Company'].unique()

<StringArray>
['TCS', 'Infosys', 'Cognizant', nan, 'Infosys Pvt Lmt']
Length: 5, dtype: str

In [41]:
df['Age'].unique()

array([20., 30., 35., 40., 23., nan, 34., 45., 18., 22., 32., 37., 50.,
       21., 46., 36., 26., 41., 24., 25., 43., 19., 38., 51., 31., 44.,
       33., 17.,  0., 54.])

In [42]:
df['Place'].unique()
# spelling correction for 'Podicherry'.

<StringArray>
[   'Chennai',     'Mumbai',   'Calcutta',      'Delhi', 'Podicherry',
     'Cochin',          nan,      'Noida',  'Hyderabad',     'Bhopal',
     'Nagpur',       'Pune']
Length: 12, dtype: str

In [44]:
df['Place']=df['Place'].replace('Podicherry','Pondicherry')
df['Place'].unique()

<StringArray>
[    'Chennai',      'Mumbai',    'Calcutta',       'Delhi', 'Pondicherry',
      'Cochin',           nan,       'Noida',   'Hyderabad',      'Bhopal',
      'Nagpur',        'Pune']
Length: 12, dtype: str

In [45]:
df.describe()

              Age       Salary      Gender
count  127.000000   121.000000  144.000000
mean    30.527559  5283.471074    0.222222
std     11.114717  2585.373600    0.417191
min      0.000000  1089.000000    0.000000
25%     22.000000  3030.000000    0.000000
50%     33.000000  5000.000000    0.000000
75%     37.500000  8000.000000    0.000000
max     54.000000  9876.000000    1.000000

Data Cleaning

#Outlier detection in 'Age' column=IQR

In [46]:
q1=df['Age'].quantile(0.25)
q1

np.float64(22.0)

In [47]:
q3=df['Age'].quantile(0.75)
q3

np.float64(37.5)

In [48]:
iqr=q3-q1
iqr

np.float64(15.5)

In [49]:
lower=q1-1.5*iqr
lower

np.float64(-1.25)

In [50]:
upper=q3+1.5*iqr
upper

np.float64(60.75)

In [51]:
df[(df['Age']<lower) & (df['Age']>upper)]
#this is used for findling outliars

Empty DataFrame
Columns: [Company, Age, Salary, Place, Country, Gender]
Index: []

In [52]:
q1=df['Salary'].quantile(0.25)
q1

np.float64(3030.0)

In [53]:
q3=df['Salary'].quantile(0.75)
q3

np.float64(8000.0)

In [54]:
iqr=q3-q1
iqr

np.float64(4970.0)

In [55]:
lower=q1-1.5*iqr
lower

np.float64(-4425.0)

In [56]:
upper=q3+1.5*iqr
upper

np.float64(15455.0)

In [57]:
df[(df['Salary']<lower) & (df['Salary']>upper)]

Empty DataFrame
Columns: [Company, Age, Salary, Place, Country, Gender]
Index: []

In [58]:
df.isna().sum()

Company     8
Age        17
Salary     23
Place      14
Country     0
Gender      0
dtype: int64

In [59]:
df['Company'].mode()[0]

'TCS'

In [61]:
df['Company']=df['Company'].fillna(df['Company'].mode()[0])

In [62]:
df.isna().sum()

Company     0
Age        17
Salary     23
Place      14
Country     0
Gender      0
dtype: int64

In [63]:
df[df['Age']==0]

       Company  Age  Salary        Place Country  Gender
87     Infosys  0.0  3030.0     Calcutta   India       0
91         TCS  0.0  3045.0        Delhi   India       0
100  Cognizant  0.0  2034.0  Pondicherry   India       0
106        TCS  0.0  9024.0      Chennai   India       1
110    Infosys  0.0  3234.0       Mumbai   India       0
120  Cognizant  0.0  1234.0     Calcutta   India       0

In [64]:
df['Age']=df['Age'].replace(0,np.nan)

In [65]:
df.isna().sum()

Company     0
Age        23
Salary     23
Place      14
Country     0
Gender      0
dtype: int64

In [66]:
df.describe()

              Age       Salary      Gender
count  121.000000   121.000000  144.000000
mean    32.041322  5283.471074    0.222222
std      8.989250  2585.373600    0.417191
min     17.000000  1089.000000    0.000000
25%     23.000000  3030.000000    0.000000
50%     33.000000  5000.000000    0.000000
75%     40.000000  8000.000000    0.000000
max     54.000000  9876.000000    1.000000

In [67]:
rounded_mean=round(df['Age'].mean(),0)
rounded_mean

np.float64(32.0)

In [68]:
df['Age']=df['Age'].fillna(rounded_mean)

In [69]:
df.isna().sum()

Company     0
Age         0
Salary     23
Place      14
Country     0
Gender      0
dtype: int64

In [70]:
rounded_salary=round(df['Salary'].mean(),0)
rounded_salary

np.float64(5283.0)

In [71]:
df['Salary']=df['Salary'].fillna(rounded_salary)

In [72]:
df['Place'].mode()

0    Mumbai
Name: Place, dtype: str

In [ ]:
df['Place']=df['Place'].fillna(df['Place'].mode()[0,1])

Company    0
Age        0
Salary     0
Place      0
Country    0
Gender     0
dtype: int64

In [75]:
df

             Company   Age  Salary     Place Country  Gender
0                TCS  20.0  5283.0   Chennai   India       0
1            Infosys  30.0  5283.0    Mumbai   India       0
2                TCS  35.0  2300.0  Calcutta   India       0
3            Infosys  40.0  3000.0     Delhi   India       0
4                TCS  23.0  4000.0    Mumbai   India       0
..               ...   ...     ...       ...     ...     ...
139  Infosys Pvt Lmt  22.0  8202.0    Mumbai   India       0
140              TCS  33.0  9024.0  Calcutta   India       1
141          Infosys  44.0  4034.0     Delhi   India       1
142              TCS  33.0  5034.0    Mumbai   India       1
143          Infosys  22.0  8202.0    Cochin   India       0

[144 rows x 6 columns]